Repository: necrose99/Myaamia
Catalog: ilda_full.tmx
Source language: mia
Languages: en_us

source: aacim-
en_us: Talk about him, say things about him

source: aacimon-
en_us: Speaker, presenter

source: aacimoon-
en_us: historical narrative

source: aacimw-
en_us: Council person, elected tribal official

source: aacimwaapii-
en_us: Talk on the phone, be on the internet

source: aacimwahki
en_us: land of stories

source: aacimweekaan-
en_us: Council House

source: aacimwi-
en_us: Hold council, have a council meeting, relate a story

source: aacimwihtaw-
en_us: Advise him, speak to him about it

source: aahkohkaa-
en_us: Exercise

source: aahkohkeelintam-
en_us: Care for it, pay attention to it

source: aahkohkeelintii-
en_us: Care for each other

source: aahkohkim-
en_us: Command him, be in charge of, give him direction

source: aahkohkinki-
en_us: Boss, supervisor

source: aahkohkinkii-
en_us: Be in charge

source: aahkol-
en_us: Smoke

source: aahkoleeki šoohkwaakan-
en_us: Train

source: aahkom-
en_us: Speak angrily to him, speak to him in an angry voice

source: aahkonkii-
en_us: Speak angrily, speak in an angry voice

source: aahkopihkwee-
en_us: Urinate, pee intensely

source: aahkosi-
en_us: Be angry, quarrelsome, mad

source: aahkosih-
en_us: Make him angry, mad

source: aahkoti-
en_us: Punk, fungus (Fomes fomentarius), tinder (for starting fire)

source: aahkwaahkeelintam-
en_us: Be lazy about it, negligent about it

source: aahkwaapahw-
en_us: Make him dream, cause him to dream

source: aahkwaapawaa-
en_us: Dream

source: aahkwaapawaal-
en_us: Dream of him

source: aahkwat-
en_us: be important, difficult

source: aahkwihsen-
en_us: it is difficult to use, in a problematic condition

source: aahkwiteeheeyon-
en_us: Sullenness

source: aahpitesi-
en_us: Go onward, continue

source: aahpitohsee-
en_us: Walk on, keep moving along

source: aahsamaalakiinkwee-
en_us: Look to the side

source: aahsamihšin-
en_us: Lie on one's back

source: aahsansi-
en_us: Bask in the sun, sunbathe

source: aahsantee-
en_us: It is sunny, the sun shines

source: aahsanteepakw-
en_us: Grape (Vitis spp.)

source: aahsanteepakwaapow-
en_us: Wine, grape juice

source: aahtee-
en_us: It goes out (of a fire or light)

source: aahteeleentam-
en_us: Turn off the light, extinguish it

source: aahših-
en_us: Set an example

source: aakaawit-
en_us: Porcupine

source: aakalaahšim-
en_us: Englishman, British Person

source: aakalaahšima paaskoonti-
en_us: Soccer

source: aakalaahšimaatawee-
en_us: Speak english

source: aakalaahšimaataweenk-
en_us: English language

source: aakooti-
en_us: Soft shelled turtle (Apalone spinifera)

source: aakwaahkw-
en_us: Behind, under, on the other side of

source: aalaahšion-
en_us: Long hunt

source: aalaankwaapanti-
en_us: Appear tired, look tired

source: aalaankwee-
en_us: Be tired, exhausted

source: aalaapi-
en_us: Look in a particular direction, observe

source: aalahkwaahkamoon-
en_us: Umbrella

source: aalahkwat-
en_us: It is cloudy

source: aalahkwatw-
en_us: Cloud

source: aalakoontaakan-
en_us: Ladder, stairway

source: aalawinam-
en_us: Refuse it

source: aalhsaalakiinkwaakan-
en_us: Eyeglasses

source: aalhsaalakiinkwee-
en_us: Wear glasses

source: aalhsepowee-
en_us: Have hiccups

source: aalhsoohkaal-
en_us: Tell a winter story about him

source: aalhsoohkaan-
en_us: a winter story

source: aalhsoohkaatam-
en_us: Tell a winter story about it

source: aalhsoohkaw-
en_us: Tell a winter story to him

source: aalhsoohkii-
en_us: Tell a winter story

source: aalim-
en_us: Must, have to, bound to

source: aalimat-
en_us: It is difficult

source: aalimesi-
en_us: Be difficult, be cross, hard to get along with

source: aalimiihtaw-
en_us: Cook for him

source: aalimiihtoo-
en_us: cook it

source: aalimiihtw-
en_us: Chef, cook, food preparer

source: aalimiihtwikaan-
en_us: Kitchen

source: aalint-
en_us: some, part

source: aalohsen-
en_us: be useless, futile

source: aalom-
en_us: Refuse him, reject him

source: aalošam-
en_us: fail to cut it, cannot cut it

source: aalweeli-
en_us: Fail at doing something, cannot

source: aalwihšin-
en_us: Fail to get hurt

source: aamaawi-
en_us: Bee

source: aamaawia paankosaakan-
en_us: Honey

source: aancihsah-
en_us: To make them migrate, relocate, remove them

source: aancihsee-
en_us: Change location, move

source: aancihtaaki-
en_us: Change maker

source: aancihtaw-
en_us: change it, fix it for him

source: aancihtoo-
en_us: Change it, repair it, fix it

source: aancikii-
en_us: Change residence, move to a dfferent house

source: aancimotayi-
en_us: Change one's clothes

source: aanciniiki-
en_us: Grow, develop, mature

source: aanciniikin-
en_us: It grows, develops, matures

source: aancipakat-
en_us: (the tree) changes its leaves

source: aancipelakii-
en_us: Have one's health or life improve for the better

source: aanciteehee-
en_us: Change one's feelings about something, have a change of heart

source: aanhkwiniikion-
en_us: Linking the generations

source: aankwaahsakw-
en_us: Driftwood

source: aankwaahsakwa siipiiw-
en_us: White River-East Fork (Indiana)

source: aankwahaakan-
en_us: Broom

source: aankwaham-
en_us: Sweep it, Play Broomball

source: aankweepi-
en_us: Be at rest

source: aantaaši
en_us: over yonder, in this direction

source: aantapi-
en_us: Sit elsewhere, change one's seat

source: aanteekw-
en_us: Crow

source: aapacilaatawi-
en_us: Mockingbird (Mimus polyglottos)

source: aapaciteehee-
en_us: Undecided, unsure

source: aapahkošam-
en_us: Cut it off, sever it

source: aapisehkaw-
en_us: cheer up, revive someone by one's presence

source: aaponam-
en_us: Give it back

source: aapool-
en_us: Bring him back

source: aapooš-
en_us: Also, again

source: aapw-
en_us: Return, back

source: aapwaalaapi-
en_us: Look back

source: aapwee-
en_us: Return, come back

source: aapweeyaa-
en_us: It returns

source: aapweeyohsee-
en_us: Walk back

source: aatotam-
en_us: Talk about it, discuss it, debate it, give an account of something

source: aatotamaatii-
en_us: Talk with each other about it

source: aawiki
en_us: Present and past time

source: aayaacimwaakaanhs-
en_us: Cell phone

source: aayaacimwaakan-
en_us: Phone

source: aayaahkam-
en_us: Totally, completely, very, forever

source: aayaahkamehkaa-
en_us: Gone forever

source: aayaakampikan-
en_us: Yawn

source: aayaalhsoohkia
en_us: storyteller

source: aayaapootakowi-
en_us: Osprey (Pandion haliaetus)

source: aayaapweeyohsee-
en_us: Walk and return, take a walk

source: aayaaše
en_us: every other

source: aayohoowi-
en_us: Iowa person

source: aayoonsee-
en_us: Black Walnut (nut)

source: aayoonseekaahkw-
en_us: Black Walnut Tree (Juglans nigra)

source: aašawe
en_us: in exchange, reciprocally, across

source: aašawee-
en_us: Barter, trade (something)

source: aašawi-
en_us: Trader

source: aašawil-
en_us: Barter, trade (something) with him

source: aašim-
en_us: coax him, encourage him, urge him

source: aašipehkw-
en_us: Bluff, cliff

source: aašipehkwihsenonki
en_us: Rock Creek

source: aašit-
en_us: in turn

source: aašitehkam-
en_us: Meet up with it, come across it

source: aašitehkaw-
en_us: Meet him, met him

source: aašoohkoon-
en_us: Ice

source: aašoohkoonaahkwi
en_us: hockey stick

source: aašoohkoonaapow-
en_us: Ice Water

source: aašoohkoonaten-
en_us: Glacier, ice mountain

source: aašoohkoonawahki-
en_us: It is sleet

source: aašoohkooni-
en_us: It is icy

source: aašoošiwi-
en_us: Nettle (Urtica dioica & Urtica chamaedryoides)

source: acihkw-
en_us: Stump (of a tree)

source: aciik-
en_us: Fisher (Martes pennanti), Ursa Major (constellation)

source: aciikamwaapahee-
en_us: give birth to twins

source: aciikant-
en_us: Garden hoe, plow

source: aciikisi-
en_us: to be twins

source: aciiphkahkionk-
en_us: Vincennes, Indiana, Place of Roots

source: aciipihk-
en_us: Root

source: acipwi-
en_us: Ojibwe person

source: aciw-
en_us: Hill, mountain, ridge

source: ahk-
en_us: Field, garden

source: ahkaapat-
en_us: It is easy

source: ahkaati-
en_us: Have feet

source: ahkalaamwi-
en_us: Drown

source: ahkan-
en_us: Wheel, tire

source: ahkanihkw-
en_us: Awl (for sewing)

source: ahkapakintee-
en_us: It is cheap

source: ahkawaah-
en_us: Wait for him

source: ahkawaahtoo-
en_us: Wait for it

source: ahkawaapam-
en_us: Watch over him, watch out for him, take care of him

source: ahkašaakan-
en_us: Horseshoe

source: ahkaši-
en_us: Have nails, claws, hooves

source: ahkic-
en_us: on top of, on the surface of

source: ahkihkonehs-
en_us: Small cooking pot

source: ahkihkw-
en_us: Kettle, bucket, pot, pan (for cooking)

source: ahkiinšikwi-
en_us: Have eyes

source: ahkimotay-
en_us: Bag (for carrying), pocket

source: ahkink-
en_us: Outside

source: ahkinši-
en_us: Have a forehead

source: ahkiwani-
en_us: Have a nose, beak

source: ahkiyošiwi-
en_us: Be an old man

source: ahkoleetaakan-
en_us: Sheath, Case

source: ahkoow-
en_us: Follow him, come after him

source: ahkow-
en_us: Last, at the end

source: ahkwaahkii-
en_us: Throw so far

source: ahkwaamaahkwee-
en_us: Climb a tree

source: ahkwaanteem-
en_us: Door

source: ahkwaataakan-
en_us: Sewing Machine

source: ahkwaataakii-
en_us: Sew something

source: ahkwaatam-
en_us: Sew it

source: ahkwaatamaw-
en_us: sew it for him

source: ahkwaatee-
en_us: it is sewn

source: ahkwaniisoons-
en_us: Little girl

source: ahkwanisw-
en_us: Young girl

source: ahkweehs-
en_us: Young woman (unmarried)

source: ahkweehsimw-
en_us: Female animal

source: ahpen-
en_us: Potato

source: ahpwaa-
en_us: Smoke tobacco

source: ahpwaakan-
en_us: Pipe

source: ahpwaakana siipiiw-
en_us: Pipe Creek

source: ahpyaa-
en_us: Arrive at a place

source: ahs-
en_us: Have him, put him

source: ahsahkw-
en_us: Muskrat (Ondatra zibethicus)

source: ahsalat-
en_us: Salad

source: ahsap-
en_us: Fishnet, spider web, Indian Hemp, dogbane (Apocynum cannabinum)

source: ahsawaankati-
en_us: Feather, plume

source: ahseem-
en_us: Tobacco

source: ahseensi-
en_us: Have an older brother

source: ahsen-
en_us: Stone, rock

source: ahsenaamiš-
en_us: Sugar Maple Tree (Acer saccharum)

source: ahsenaamišahk-
en_us: Sugar maple grove

source: ahsenaamišipoohkii-
en_us: Collect Sap, Go Sugaring

source: ahsenaamišipow-
en_us: Maple Sap

source: ahsenaapiikatoo-
en_us: Shoot rocks using a slingshot

source: ahsenahkihkw-
en_us: stone pot, pottery

source: ahseni siipiw-
en_us: Great Miami River (Ohio)

source: ahsenikaan-
en_us: Stone building

source: ahsenintehs-
en_us: Pebble

source: ahsenip-
en_us: Lead (Metal)

source: ahsiimin-
en_us: Pawpaw fruit (Asimina triloba)

source: ahsiimišaahkw-
en_us: pawpaw tree (Asimina triloba)

source: ahtawaan-
en_us: Tree, stick, piece of wood

source: ahtawaanahk-
en_us: Forest

source: ahtawaanahkisinaakan-
en_us: Snowshoe

source: ahtawaanihs-
en_us: Twig, stick, small piece of wood

source: ahtawaki-
en_us: Have ears

source: ahtee-
en_us: it is there, located

source: ahtehsaakan-
en_us: Paint, dye (substance)

source: ahtehsam-
en_us: Paint it, dye it

source: ahtehsiko-
en_us: Do painting

source: ahtehsw-
en_us: Paint him

source: ahtel-
en_us: accuse him, blame him

source: ahtem-
en_us: Catch up with him, overtake him

source: ahtoo-
en_us: Have it, put it

source: ahšam-
en_us: Feed him

source: ahšikan-
en_us: Largemouth bass (Micropterus salmoides)

source: ahšitahtoo-
en_us: Attach it

source: ahšitenam-
en_us: Stick it on, fasten it on (by hand)

source: ahšitesam-
en_us: Glue it together

source: ahšitisaakan-
en_us: Glue

source: akaaminki
en_us: across the water

source: akaaw-
en_us: Walleye

source: akaawi-
en_us: Thorn, briar, porcupine quill

source: akaawiahkihkiwi-
en_us: it is land full of thorns

source: akaawiahkionki
en_us: Thorntown

source: akaawinšaahkw-
en_us: Honey Locust (Gleditsia triacanthos)

source: akaayomin-
en_us: Gooseberry

source: akaayomišaahkw-
en_us: Gooseberry Bush

source: akim-
en_us: Chief, leader

source: akimaahkwi-
en_us: Female chief, leader

source: akimaanhsehkw-
en_us: Young female leader (Tribal Princess)

source: akimaawion-
en_us: Civic knowledge, chiefdom

source: akinciko-
en_us: Compute, Figure out, Do counting

source: akincikoon-
en_us: Number, phone number

source: akincikoona
en_us: numerals, numbers

source: akook-
en_us: Frog

source: akootaakan-
en_us: Hanger, pot hook

source: akoten-
en_us: it hangs, is hanging

source: akotoo-
en_us: hang it up

source: akow-
en_us: Female deer, doe

source: akwanaham-
en_us: Cover it, put a lid on it

source: akwanahw-
en_us: cover him, conceal him

source: akwaniinkwaakan-
en_us: General face mask, halloween mask, thing that covers the face

source: akwaniinkwee-
en_us: Wear a halloween mask, face mask that covers the face

source: akwanileehsaakan-
en_us: Dust mask, face mask, thing that covers the breath

source: akwanileehsee-
en_us: Wear a dust mask, face mask, a thing that covers your breath

source: akwenkohs-
en_us: Chipmunk (Tamias striatus)

source: akwiiyom-
en_us: Have as a boyfriend

source: akwincitoo-
en_us: Soak it, water it (plant)

source: alaak-
en_us: Yesterday

source: alaakan-
en_us: Plate, bowl, dish (generic)

source: alaakwi-
en_us: It is evening

source: alaama
en_us: llama

source: alaamahw-
en_us: hit him hard, wound him badly

source: alaami-
en_us: Go fast, hurry

source: alaamihpenal-
en_us: Hurt him, injure him

source: alaamihsen-
en_us: It is windy

source: alaamihtam-
en_us: Believe it

source: alaamihtaw-
en_us: Believe him

source: alaamihšikaateekani-
en_us: To hurt toe, stub toe

source: alaamihšin-
en_us: Hurt oneself

source: alaamilaw-
en_us: Wound him

source: alaaminaa-
en_us: Pray

source: alaaminaakaan-
en_us: Church (Building)

source: alaaminki
en_us: beneath, inside, within

source: alaamipiikw-
en_us: underwater

source: alaamwee-
en_us: Tell the truth

source: alaamweekaneewi-
en_us: It is the truth, it is correct

source: alaankw-
en_us: Star

source: alaankwi-
en_us: Rainbow

source: alaankwihsen-
en_us: Meteorite

source: alaansoon-
en_us: Bullrush (Scirpus spp.), reed mats (for sitting or sleeping)

source: alahwi-
en_us: Choke on something

source: alakay-
en_us: Egg Shell

source: alakiihkw-
en_us: Tree bark

source: alakiihkwikaan-
en_us: Bark house

source: alam-
en_us: Put it in the water

source: alamoni
en_us: Red ocher, paint, vermillion

source: aleciimin-
en_us: Pea

source: aleelii-
en_us: Bathe, take a bath, shower

source: aleeliih-
en_us: Bathe him, give him a bath

source: aleeliihaakan-
en_us: Bathtub

source: aleeliikaan-
en_us: Bathroom, restroom (private)

source: aleew-
en_us: Bull snake (Pituophis catenifer sayi)

source: alehšaahe
en_us: customarily

source: alehši
en_us: in vain, for no reason

source: alemontehs-
en_us: Puppy

source: alemw-
en_us: Dog (Canis lupus familiaris)

source: alemwaapiikw-
en_us: Dog leash

source: alenasw-
en_us: Buffalo, cow

source: alenasway-
en_us: Cowhide

source: alenaswihkanaw-
en_us: Bison Trace

source: aleni
en_us: apparently, as though, probably

source: aleni-
en_us: Grown man

source: aleniaahsimw-
en_us: Male animal

source: alenkwan-
en_us: Wing

source: alikalakonci
en_us: Beyond, on the far side

source: alikonci
en_us: Further off, in that direction, yonder, on the other side

source: alimaahkii-
en_us: Pack and prepare to leave one's place

source: alohtaw-
en_us: imitate him, mimic him

source: aloohw-
en_us: Aim at him, point at him

source: aloohwiton-
en_us: To point with mouth

source: alool-
en_us: Hire him

source: aloonihs-
en_us: Bullet (older 'arrow')

source: alotam-
en_us: Avenge him

source: alwaahtam-
en_us: Like to hear it

source: alwaahtaw-
en_us: Like to hear him

source: alwaamyaakosi-
en_us: Smell good, nice

source: alwaamyaakwan-
en_us: it smells nice

source: alwaanam-
en_us: Admire it, think well of it, like to do it

source: alwaanaw-
en_us: Admire him, think well of him

source: alwasi-
en_us: Be in a good mood

source: alwasihtoo-
en_us: Amused by it, have fun with it

source: amaamaayomaa-
en_us: Have eyebrows

source: amamwi-
en_us: Be awake, wake up

source: amataahkomi-
en_us: wear, put on clothes

source: amaten-
en_us: Wake him (by hand)

source: amehkw-
en_us: Beaver (Castor canadensis), dollar

source: amiincipemi-
en_us: Have corn

source: aminootee-
en_us: Be from a certain town, village

source: ampaahkii-
en_us: Throw, toss something upwards

source: ampaapiikinam-
en_us: Pick up threads

source: ampahwi-
en_us: Fly

source: ampen-
en_us: I lift him up

source: ampenam-
en_us: Lift it up

source: ampihciwee-
en_us: Raise one's hand

source: ampihsaa-
en_us: Jump

source: ampisitaakan-
en_us: Yeast, baking soda, baking powder

source: amw-
en_us: Eat him (animate things)

source: anaahkap-
en_us: Tree branch

source: anaahkapenihs-
en_us: Little branch

source: anaahkii-
en_us: Lay out a mat, rug

source: ancamaac-
en_us: Hopefully

source: ancihkwi-
en_us: Be pregnant

source: aneh-
en_us: Beat him, defeat him

source: anehiwee-
en_us: Be victorious, win

source: anehki-
en_us: Have hands

source: aniicaanihsi-
en_us: Have a child

source: aniihpikatomi-
en_us: Have blood

source: anikw-
en_us: Squirrel (Sciurus carolinensis)

source: ankih-
en_us: Killing him, killed him

source: ankihtoo-
en_us: Kill it, suicide

source: ankin-
en_us: It is destroyed, ruined

source: anseens-
en_us: Algae

source: anseensaapiikw-
en_us: green ribbon

source: anseensee-
en_us: It is bright green

source: anseenseekin-
en_us: It is bright green cloth, paper

source: anseensi-
en_us: Be bright green

source: anseepikw-
en_us: Spider

source: ansihke
en_us: ever, never

source: ansiwataakan-
en_us: Seed (for planting)

source: ansiwatoo-
en_us: Plant it

source: ansonam-
en_us: Gather it together by hand

source: ansoopi-
en_us: Sit together

source: answee-
en_us: To speak together as one

source: answiteehee-
en_us: Be in agreement, agree

source: antepi-
en_us: have brains

source: antepikani-
en_us: Have a head

source: antopali-
en_us: one in a war party, warrior

source: apahkwaan-
en_us: Roof (of a house)

source: apahkway-
en_us: Cattail (Typha latifolia), mats (for lodge covering)

source: apahkwee-
en_us: Roof a house

source: apanšay-
en_us: Tent pole, lodge pole, rafter

source: apeehkoohsi-
en_us: Turkey Vulture (Cathartes aura)

source: apeehkw-
en_us: Common Nighthawk (Chordeiles minor)

source: apeehsi-
en_us: Fawn

source: apeleehsiomi-
en_us: Have a raven, invoke ravens

source: apesam-
en_us: Warm it, heat it up

source: apesw-
en_us: Warm him, heat him up (as in food)

source: apeswi-
en_us: Be warm

source: apetee-
en_us: It is heated, warm

source: api-
en_us: Be located, be at a place

source: apihkaal-
en_us: Braid his/her hair

source: apihkii-
en_us: Braid (one's own) hair, have braids

source: apihšihtoo-
en_us: Shorten it, reduce it, make it smaller

source: apiihkani-
en_us: Groundnut (Apios americana), Hog peanut

source: apiinkweesi-
en_us: Warm one's face

source: apikaateesi-
en_us: Warm one's feet

source: apikamesam-
en_us: Warm up liquid, soup, broth

source: apikamitee-
en_us: It is warm liquid, soup, broth

source: apikaneesi-
en_us: Warm one's legs

source: apili-
en_us: it is small

source: apiloohs-
en_us: Child; ginseng

source: apinay-
en_us: Bed

source: apineens-
en_us: Sofa, couch

source: apinehkiisi-
en_us: Warm one's hands

source: apwaacikont-
en_us: Roasting scaffold

source: apwaal-
en_us: Roast him, grill him, broil him (as in food)

source: apwaam-
en_us: Ham

source: apwaatam-
en_us: Roast it, grill it, broil it

source: apweekan-
en_us: Grill

source: apween-
en_us: Roast

source: asaahsi-
en_us: Have tattoos, get tattooed

source: asaahsion-
en_us: Tattoo

source: asaahsw-
en_us: Tattoo him

source: asiikami-
en_us: Garfish (Lepisosteus spp.)

source: ataahpahtaakan-
en_us: Drawer

source: ataahpahtoo-
en_us: Pull it, pull it out

source: ataahpantam-
en_us: Draw it out by mouth

source: ataahsi-
en_us: Wear/put on leggings, stockings, socks

source: ataam-
en_us: Sell (it) to him

source: ataawee-
en_us: Sell (something)

source: ataaweekaan-
en_us: Store, shop, trading house

source: atahkiomi-
en_us: Have a field, a garden

source: atahkohkan-
en_us: Bridge

source: atahkohkii-
en_us: Cross a bridge

source: atahkweehsim-
en_us: Have as a girlfriend

source: atakin-
en_us: It is wet

source: atamaapam-
en_us: Be busy looking at him

source: atamihwi-
en_us: Be busy

source: atayi-
en_us: Have a pet, an animal

source: atayim-
en_us: Have him as a pet, have control over him

source: ateehi-
en_us: Have a heart

source: ateehimin-
en_us: Strawberry (Fragaria virginiana)

source: ateehseemin-
en_us: plum

source: ateehseemišaahkw-
en_us: Plum tree (Prunus domestica)

source: atehkon-
en_us: Knot (on tree)

source: atehsi-
en_us: be ripe

source: atehtee-
en_us: It is ripe

source: atehtoleni-
en_us: Wear a hat, put on a hat

source: atekipane
en_us: exclamation upon hearing unpleasant news

source: ateliwaten-
en_us: the ice is thin, ice is starting to form

source: atenamaw-
en_us: accept, receive from him

source: atoohpoon-
en_us: Table

source: atoohpooneens-
en_us: End table

source: awal-
en_us: Take him along, lead him

source: awan-
en_us: It is foggy

source: awansaapi-
en_us: East, sunrise

source: awansi-
en_us: Warm oneself

source: awataakan-
en_us: piece of mail, letter

source: awataw-
en_us: Carry it to him, send it to him

source: awatoo-
en_us: Take it along, carry it

source: aweehs-
en_us: Wild Animal

source: aweehseens-
en_us: Bird (larger than sparrow size)

source: aweehseewi-
en_us: Be an animal

source: aweehsikaan-
en_us: Barn, animal pen

source: aweem-
en_us: Be related to him, allied with him, thank him

source: aweemaakan-
en_us: Cousin, relative

source: aween-
en_us: Who

source: aweenkii-
en_us: Be thankful

source: aweentii-
en_us: Be related to each other

source: aweentioni
en_us: peace, alliance, family

source: aweey-
en_us: Some person, someone

source: awih-
en_us: Lend to him, loan to him

source: awiihkaani-
en_us: Have friend(s)

source: awiihkaanim-
en_us: Have him as a friend

source: awiihkaanintii-
en_us: Be friends with each other

source: awiila
en_us: Him, her, he, she

source: awiilani-
en_us: Have a tongue

source: awiilwa
en_us: They, them

source: awiipiti waapahaakan-
en_us: Toothpaste

source: awiipiti-
en_us: Have teeth

source: awiiwiil-
en_us: Antler, horn, braid

source: awiiwiileehs-
en_us: Powder Horn

source: awikaakan-
en_us: Pen, pencil

source: awikaal-
en_us: Write on him

source: awikaw-
en_us: Write to him, text him, email him

source: awikii-
en_us: Write

source: awipihšimwi-
en_us: Dress warmly

source: awipitee-
en_us: It is warm

source: aya
en_us: Hello, Hi (General greeting)

source: ayaa-
en_us: Go to a place

source: ayaakwaamisi-
en_us: Make every effort, strive diligently, have courage

source: ayaakwaamision-
en_us: Striving

source: ayaapi-
en_us: Buck, Stag

source: ayaapiay-
en_us: Buck skin

source: ayiihkwi-
en_us: Be hungry

source: ayiilatem-
en_us: Make him cold

source: ayiileepi-
en_us: Remain sitting, stay behind

source: ayoo-
en_us: Use it

source: ayoolhka
en_us: more, most

source: ašaahšikop-
en_us: Slippery Elm (Ulmus rubra)

source: ašihsay-
en_us: Nest, hive

source: ašiihkionam-
en_us: Smear dirt on it

source: ašiihkiw-
en_us: Earth, Land, Dirt, Soil

source: ašiihkiwi-
en_us: Be covered with dirt, dirty

source: -caankw-
en_us: Brother's wife, sister-in-law (woman speaking)

source: -cihciikama
en_us: Spirit of the living, soul, shadow

source: -ciit-
en_us: anus

source: caaciilitee-
en_us: There is a drought

source: caaciinkilaaki-
en_us: Shagbark hickory, shellbark hickory (Carya ovata, Carya laciniosa)

source: caaht-
en_us: Hairy Woodpecker (Picoides villosus)

source: camonkaahkaal-
en_us: Throw him into the water

source: camonkihsaa-
en_us: Jump in the water

source: cecaahkw-
en_us: Sandhill crane (Grus canadensis)
